In [1]:
import pandas as pd

In [2]:
ser1 = pd.Series([1,3,34,5,3,7,8,0])
ser1

0     1
1     3
2    34
3     5
4     3
5     7
6     8
7     0
dtype: int64

In [3]:
df1 = pd.DataFrame([1,3,34,5,3,7,8,0])
df1

    0
0   1
1   3
2  34
3   5
4   3
5   7
6   8
7   0

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       8 non-null      int64
dtypes: int64(1)
memory usage: 192.0 bytes

In [8]:
ser1.std() # standard deviation

11.00568035152757

In [13]:
df2 = pd.DataFrame()
print(df2)

Empty DataFrame
Columns: []
Index: []

In [21]:
lst = [i for i in range(100,160, 10)]

df2 = pd.DataFrame(data=[[lst,lst]], columns=['Amount', 'numbers'])
df2

                           Amount                         numbers
0  [100, 110, 120, 130, 140, 150]  [100, 110, 120, 130, 140, 150]

In [22]:
data = {'Name': ['Max', 'Lara', 'Koke', 'muller'],
		'Age': [10, 31, 91, 48]}

df2 = pd.DataFrame(data)
df2

     Name  Age
0     Max   10
1    Lara   31
2    Koke   91
3  muller   48

In [23]:
data = {'Name': ['shiv', 'lucky', 'moksha', 'raj'],
		'Age': [24, 31, 1, 23]}

df3 = pd.DataFrame(data)
df3

     Name  Age
0    shiv   24
1   lucky   31
2  moksha    1
3     raj   23

In [35]:
df4 = pd.concat([df2,df3])
df4

     Name  Age
0     Max   10
1    Lara   31
2    Koke   91
3  muller   48
0    shiv   24
1   lucky   31
2  moksha    1
3     raj   23

In [30]:
df2.append(df3)

C:\Users\skumar\AppData\Local\Temp\ipykernel_11708\4157018329.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(df3)

     Name  Age
0     Max   10
1    Lara   31
2    Koke   91
3  muller   48
0    shiv   24
1   lucky   31
2  moksha    1
3     raj   23

In [31]:
  
# creating first series
first =[1, 2, np.nan, 5, 6, 3, np.nan, 7, 11, 0, 4, 8]
  
# creating second series
second =[5, 3, 2, np.nan, 1, 3, 9, 21, 3, np.nan, 1, np.nan]
  
# making series
first = pd.Series(first)
  
# making seriesa
second = pd.Series(second)
  
# calling .combine() method
result = first.combine(second, func =(lambda x1, x2: x1 if x1 > x2 else x2), fill_value = 5)
  
# display
result

0      5.0
1      3.0
2      2.0
3      NaN
4      6.0
5      3.0
6      9.0
7     21.0
8     11.0
9      NaN
10     4.0
11     NaN
dtype: float64

In [34]:
res1= first.combine(second, lambda x1, x2 : x1)
res1

0      1.0
1      2.0
2      NaN
3      5.0
4      6.0
5      3.0
6      NaN
7      7.0
8     11.0
9      0.0
10     4.0
11     8.0
dtype: float64

In [39]:
df4['Name'].where(df4['Name'] == 'shiv').dropna()

0    shiv
Name: Name, dtype: object

In [42]:
df4.reset_index(inplace=True)

In [43]:
df4

   index    Name  Age
0      0     Max   10
1      1    Lara   31
2      2    Koke   91
3      3  muller   48
4      0    shiv   24
5      1   lucky   31
6      2  moksha    1
7      3     raj   23

In [44]:
df4['Name'].where(df4['Name'] == 'shiv').dropna()

4    shiv
Name: Name, dtype: object

In [47]:
df4.sort_values(by='Age')

   index    Name  Age
6      2  moksha    1
0      0     Max   10
7      3     raj   23
4      0    shiv   24
1      1    Lara   31
5      1   lucky   31
3      3  muller   48
2      2    Koke   91